app/views/posts/index.html.erb

SELECT  "challenges".* FROM "challenges" WHERE "challenges"."id" = $1 LIMIT 1  [["id", 21]]
---
    <div id="challenge-heading">
      <b><%= post.challenge.content unless post.challenge.blank? %></b>