app/views/posts/show.html.erb

    <div id="challenge-heading">
      <b><%= post.challenge.content unless post.challenge.blank? %></b>
---
SELECT  "challenges".* FROM "challenges" WHERE "challenges"."post_id" = $1 LIMIT 1  [["post_id", 1]]