app/controllers/posts_controller.rb

  def show
    @posts = Post.all
---
SELECT "posts".* FROM "posts"

  def new
    count = current_user.posts.where('created_at > ?', 24.hours.ago).count
    if count > 1
      @post = Post.new
      r = Random.new
      number = r.rand(1...25)
      @challenge = Challenge.find(number)
---
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = $1 AND (created_at > '2016-03-21 02:14:27.613511')  [["user_id", 1]]
SELECT  "challenges".* FROM "challenges" WHERE "challenges"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "challenge_id", "whatIdid", "whatIlearnt", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "blue"], ["challenge_id", 13], ["whatIdid", "red"], ["whatIlearnt", "yellow"], ["user_id", 1], ["created_at", "2016-03-21 07:47:54.299165"], ["updated_at", "2016-03-21 07:47:54.299165"]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "image_file_name" = $1, "image_file_size" = $2, "image_updated_at" = $3, "updated_at" = $4 WHERE "posts"."id" = $5  [["image_file_name", "instagram1.jpg"], ["image_file_size", 81717], ["image_updated_at", "2016-03-23 12:36:47.581408"], ["updated_at", "2016-03-23 12:36:47.775877"], ["id", 10]]